# labyrinth_game/constants.py
ROOMS = {
    'entrance': {
        'description': 'Вы в темном входе лабиринта. Стены покрыты мхом. '
                       'На полу лежит старый факел.',
        'exits': {'north': 'hall', 'east': 'trap_room'},
        'items': ['torch'],
        'puzzle': None
    },
    'hall': {
        'description': 'Большой зал с эхом. По центру стоит пьедестал с запечатанным '
                       'сундуком.',
        'exits': {'south': 'entrance', 'west': 'library', 'north': 'treasure_room'},
        'items': [],
        'puzzle': ('На пьедестале надпись: "Назовите число, которое идет после девяти".'
                   ' Введите ответ цифрой или словом.',
                   ['10', 'десять', 'ten', 'b1010'], ['small_budda_statue'])
    },
    'trap_room': {
          'description': 'Комната с хитрой плиточной поломкой. На стене видна надпись:'
                         ' "Осторожно — ловушка".',
          'exits': {'west': 'entrance'},
          'items': ['rusty_key'],
          'puzzle': ('Система плит активна. Чтобы пройти, назовите слово "шаг" три раза'
                     ' подряд (введите "шаг шаг шаг")', ['шаг шаг шаг'],
                     ['protective_charm', 'treasure_key'])
    },
    'library': {
          'description': 'Пыльная библиотека. На полках старые свитки. Где-то здесь '
                         'может быть ключ от сокровищницы.',
          'exits': {'east': 'hall', 'north': 'armory'},
          'items': ['ancient_book'],
          'puzzle': ('В одном свитке загадка: "Что растет, когда его съедают?"'
                     ' (ответ одно слово)',
                     ['резонанс', 'resonance', 'аппетит', 'appetite', 'голод', 'hunger']
                         , ['wisdom_script'])
    },
    'armory': {
          'description': 'Старая оружейная комната. На стене висит меч, рядом — '
                         'небольшая бронзовая шкатулка.',
          'exits': {'south': 'library', 'east': 'chapel', 'west': 'barracks'},
          'items': ['sword', 'bronze_box'],
          'puzzle': None
    },
    'treasure_room': {
          'description': 'Комната, на столе большой сундук. Дверь заперта — нужен '
                         'особый ключ.',
          'exits': {'south': 'hall'},
          'items': ['treasure_chest'],
          'puzzle': ('Дверь защищена кодом. Введите код (подсказка: это число '
                     'пятикратного шага, 2*5= ? )',
                     ['10', 'десять', 'ten', 'b1010'], ['tons_of_gold'])
    },
    'chapel': {
            'description': 'Крохотная темная комната с алтарем и разбитыми скамейками,'
                           ' освещаемая свечами. Пахнет благовониями. ',
            'exits': {'west': 'armory', 'south': 'barracks'},
            'items': [],
            'puzzle': ('Каждый вошедший да оставит здесь грехи свои, каждый вышедший'
                       'да обретет свет. Надо помолиться (введите "помолиться")',
                       ['помолиться', 'молитва', 'очиститься'], ['candle'])
    },
    'barracks': {
            'description': 'Длинное помещение с двумя рядами разваленных коек. На столе'
                           ' у дальней стены брошены картами и игральные кости. Партия '
                           'так и не была доиграна.',
            'exits': {'north': 'chapel', 'east': 'armory'},
            'items': ['lucky_dice'],
            'puzzle': None
    }
}

COMMANDS = {
    "go <direction>": "перейти в направлении (north/south/east/west)",
    "look": "осмотреть текущую комнату",
    "take <item>": "поднять предмет",
    "use <item>": "использовать предмет из инвентаря",
    "inventory": "показать инвентарь",
    "solve": "попытаться решить загадку в комнате",
    "quit": "выйти из игры",
    "help": "показать это сообщение"
}